# Practice with Filtering

Read in the file "College_Salary_Data.csv" and answer the following questions

In [1]:
#Read in the data
import pandas as pd

df = pd.read_csv("data\College_Salary_Data.csv")
df.head()

,Unnamed: 0,School Name,School Type,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary,Region
0,0,Massachusetts Institute of Technology (MIT),Engineering,72200.0,126000.0,76800.0,99200.0,168000.0,220000.0,Northeastern
1,1,California Institute of Technology (CIT),Engineering,75500.0,123000.0,NaN,104000.0,161000.0,NaN,California
2,2,Harvey Mudd College,Engineering,71800.0,122000.0,NaN,96000.0,180000.0,NaN,California
3,3,"Polytechnic University of New York, Brooklyn",Engineering,62400.0,114000.0,66800.0,94300.0,143000.0,190000.0,Northeastern
4,4,Cooper Union,Engineering,62200.0,114000.0,NaN,80200.0,142000.0,NaN,Northeastern

How many school-dept pairs have a starting salary greater than 65K?

In [7]:
#Write you code here
df.loc[df["Starting Median Salary"] >= 65000, ].shape[0]

4

What is the median mid career 75th percentile salary of party schools in a Southern or Western region?

In [16]:
#Write your code here
df_party_sw = df.loc[ (df["School Type"] == "Party") & (df["Region"].isin(["Southern", "Western"])), : ]
df_party_sw["Mid-Career 75th Percentile Salary"].median()

117500.0

What fraction of California schools have a starting median starting salary above 50K?

In [18]:
#Write your code here
df_party_cali = df.loc[ (df["Region"] == "California"), : ]

df_party_cali_50 = df.loc[ (df["Region"] == "California") & (df["Starting Median Salary"] >= 50000), : ]

fraction = len(df_party_cali_50)/len(df_party_cali)
fraction

0.4074074074074074

In [ ]:
#Put all ChatGPT codes here

# Practice with Lambda Functions

Cconvert the following simple functions to lambda functions.

In [19]:
def Get_First_Letter(name):
    """Take a name as input return the lowercase
    first letter of the name"""
    if name[0] == "J":
        first_letter = name[0].lower()
        return first_letter
    else:
        last_letter = name[-1]
        return last_letter
    

Get_First_Letter("Steve")

'e'

In [22]:
#Define your lambda function here
Get_First_Letter = lambda name: name[0].lower() if name[0] == "J" else name[-1]
Get_First_Letter("Steve")

#the question is different from the one the professor shared on the course

'e'

In [23]:
def Check_Even(x):
    """Return True if x is even and odd otherwise """
    
    return x%2 == 0

Check_Even(5)

False

In [24]:
#Define your lambda function here
Check_Even = lambda x : x%2==0
Check_Even(5)

False

In [25]:
def Get_Num(L):
    """Return the integer version of the number
    specified by the list if strings in L"""
    
    return int("".join(L))

Get_Num(["1","5","2"])

152

In [26]:
#Define your lambda function here
Get_Num = lambda L: int("".join(L))
Get_Num(["1","5","2"])

152

In [ ]:
#Put all ChatGPT codes here

# Filtering 2 Practice - Groupby

In this practice exercise, we will analyze a yelp dataset. Import pandas and numpy below and read in the data set "Yelp.csv. Then get rid of all rows with NaN.

In [50]:
#Write your code here
df_yelp = pd.read_csv("data\Yelp_Data.csv")
df_yelp.head()

,business_id,city,full_address,latitude,longitude,name,review_count,stars,state,type,...,Pakistani,Barbeque,Vietnamese,Asian Fusion,Diners,Greek,Vegetarian,Number_of_Checkins,Number_of_Tips,Number_of_Tip_Likes
0,5UmKMjUEUNdYWqANhGckJw,Dravosburg,"4734 Lebanon Church Rd Dravosburg, PA 15034",40.354327,-79.900706,Mr Hoagie,4,4.5,PA,business,...,0,0,0,0,0,0,0,0,0,0
1,UsFtqoBl7naz8AVUBZMjQQ,Dravosburg,"202 McClure St Dravosburg, PA 15034",40.350553,-79.886814,Clancy's Pub,4,3.5,PA,business,...,0,0,0,0,0,0,0,0,0,0
2,3eu6MEFlq2Dg7bQh8QbdOg,Dravosburg,"1 Ravine St Dravosburg, PA 15034",40.350956,-79.889059,Joe Cislo's Auto,3,5.0,PA,business,...,0,0,0,0,0,0,0,0,0,0
3,cE27W9VPgO88Qxe4ol6y_g,Bethel Park,"1530 Hamilton Rd Bethel Park, PA 15234",40.354115,-80.014660,Cool Springs Golf Center,5,2.5,PA,business,...,0,0,0,0,0,0,0,9,1,0
4,HZdLhv6COCleJMo7nPl-RA,Pittsburgh,"301 South Hills Village Pittsburgh, PA 15241",40.357620,-80.059980,Verizon,5,2.5,PA,business,...,0,0,0,0,0,0,0,0,0,0

Find the average star rating for each state (You can ignore the number of reviews for each restaurant). Store the result df_1.

In [51]:
#Write you code here
df_avg_star = df_yelp.groupby( by = ["state"]).stars.mean()
df_avg_star

state
AL     3.500000
AR     5.000000
AZ     3.709550
BW     3.768531
CA     3.500000
EDH    3.807995
ELN    3.791667
FIF    3.700000
HAM    4.500000
IL     3.549728
KHL    3.500000
MA     5.000000
MLN    3.842466
MN     5.000000
NC     3.587095
NM     3.000000
NTH    2.000000
NV     3.682979
NW     4.500000
ON     3.577825
OR     2.500000
PA     3.699276
QC     3.579906
RP     4.083333
SC     3.568266
SCB    4.000000
TX     4.500000
WI     3.659335
Name: stars, dtype: float64

For each state compute the avg number of stars taking into account the number of reviews they got. First create a column called "total_stars", which is stars*review.  Then use groupby to compute the sum of total_stars as well as the sum of the number of reviews for each state and store the result in df_2. After this groupby remove all states that have fewer than 100 reviews. Then use this df to create column that is the average star rating.

In [61]:
#new column
df_yelp["total_stars"] = df_yelp["stars"] * df_yelp["review_count"]
df_yelp.head()

#use groupby to compute the sum of total_stars
#as well as the sum of the number of reviews for each state and store the result in df_2.
df_2 = df_yelp.groupby( by = ["state"] )[["total_stars","review_count"]].agg( np.sum )
df_2

#remove all states that have fewer than 100 review
df_2_100 = df_2.loc[ df_2["review_count"] >= 100 , : ].copy()

#use this df to create column that is the average star rating
df_2_100["avg_rating"] = df_2_100["total_stars"]/df_2_100["review_count"]
df_2_100

       total_stars  review_count  avg_rating
state
AZ       3415475.5        905894    3.770282
BW         31424.0          8408    3.737393
CA           427.5           126    3.392857
EDH       151274.0         39086    3.870286
IL         63702.5         17273    3.687981
MLN         5079.5          1283    3.959080
NC        531745.0        144071    3.690854
NV       3904524.0       1047481    3.727537
ON         18858.0          5191    3.632826
PA        373508.5         99219    3.764486
QC         27409.5          7612    3.600828
SC         14587.0          3993    3.653143
TX          4020.0          1002    4.011976
WI        241349.5         64401    3.747605

Answer the same question as the previous question but use apply + grouply  + lambda function. Here don't worry about filtering for states with fewer than 100 reviews.

In [60]:
#Write your code here
df_3 = df_yelp.groupby( by = ["state"] )[["total_stars","review_count"]].apply( lambda x: pd.Series( 
    {"total_stars": np.sum(x["total_stars"]),
    "review_count": np.sum(x["review_count"]),
    "avg_stars": np.sum( x["total_stars"] ) / np.sum( x["review_count"] ) } ) )
df_3

       total_stars  review_count  avg_stars
state
AL            14.0           4.0   3.500000
AR           115.0          23.0   5.000000
AZ       3415475.5      905894.0   3.770282
BW         31424.0        8408.0   3.737393
CA           427.5         126.0   3.392857
EDH       151274.0       39086.0   3.870286
ELN          222.0          59.0   3.762712
FIF          139.5          39.0   3.576923
HAM           13.5           3.0   4.500000
IL         63702.5       17273.0   3.687981
KHL           28.0           8.0   3.500000
MA            15.0           3.0   5.000000
MLN         5079.5        1283.0   3.959080
MN            20.0           4.0   5.000000
NC        531745.0      144071.0   3.690854
NM            42.0          14.0   3.000000
NTH           34.0          17.0   2.000000
NV       3904524.0     1047481.0   3.727537
NW            27.0           6.0   4.500000
ON         18858.0        5191.0   3.632826
OR            22.5           9.0   2.500000
PA        373508.5       99219.0   3.764486
QC         27409.5        7612.0   3.600828
RP           128.5          33.0   3.893939
SC         14587.0        3993.0   3.653143
SCB           68.0          17.0   4.000000
TX          4020.0        1002.0   4.011976
WI        241349.5       64401.0   3.747605

Find the most popular zip code for restaurants rated in AZ and NV.

In [89]:
#Write your code here
df_4 = df_yelp.loc[ df_yelp["state"].isin(["AZ","NV"]) ].copy()
df_4["zipcode"] = df_4["full_address"].apply( lambda x: x.split(" ")[-1] )

df_4.groupby("state")["zipcode"].apply( lambda x: x.value_counts().index[0] )

state
AZ    85251
NV    89109
Name: zipcode, dtype: object

In [ ]:
#Put all ChatGPT codes here